
clear all; close all;
     
        g2r = pi/180;       %перевод градусов в радианы
        syms q1 q2 q3 q4 q5 % [град] - фактическое значение обощенных координат 
%% Показания энекодеров kuka youbot в положение "свеча"
     %q1 = 2.01;
     %q2 = 1.09;
     %q3 = -2.44;
     %q4 = 1.74;
     %q5 = 2.96;
     
 %%  Вариант Олега ДХ парметры + полученные мтарицы однородных преобразований      

%DH параметры, полученные Олегом
% Alpha   = [  g2r*(90)    ;    g2r*(0)   ;    g2r*(0)   ;  g2r*(90)     ;    g2r*(0)   ];
% Apar    = [    0.033     ;    0.155     ;    0.135     ;     0         ;      0       ];
% Dpar    = [    0.147     ;      0       ;      0       ;     0         ;    0.234     ];
% Theta   = [  g2r*(q1+0)  ;  g2r*(q2+0)  ;  g2r*(q3+0)  ;  g2r*(q4+90)  ;  g2r*(q5+0)  ];
 
% T1 = [ cos((pi*q1)/180), 0,  sin((pi*q1)/180), (0.033*cos((pi*q1)/180));
%        sin((pi*q1)/180), 0, -cos((pi*q1)/180), (0.033*sin((pi*q1)/180));
%                       0, 1,                 0,                    0.147;
%                       0, 0,                 0,                        1];

% T2 = [ cos((pi*q2)/180), -sin((pi*q2)/180), 0, (0.155*cos((pi*q2)/180));
%        sin((pi*q2)/180),  cos((pi*q2)/180), 0, (0.155*sin((pi*q2)/180));
%                       0,                 0, 1,                        0;
%                       0,                 0, 0,                        1];                  
 
% T3 = [ cos((pi*q3)/180), -sin((pi*q3)/180), 0, (0.135*cos((pi*q3)/180));
%        sin((pi*q3)/180),  cos((pi*q3)/180), 0, (0.135*sin((pi*q3)/180));
%                       0,                 0, 1,                        0;
%                       0,                 0, 0,                        1];
                   
% T4 = [ cos((pi*(q4 + 90))/180), 0,  sin((pi*(q4 + 90))/180), 0;
% sin((pi*(q4 + 90))/180),        0, -cos((pi*(q4 + 90))/180), 0;
%                       0,        1,                        0, 0;
%                       0,        0,                        0, 1];
                   
% T5 = [ cos((pi*q5)/180), -sin((pi*q5)/180), 0,       0;
%        sin((pi*q5)/180),  cos((pi*q5)/180), 0,       0;
%                       0,                 0, 1,   0.234;
%                       0,                 0, 0,       1];                  
                   

 %%  Вариант Игоря ДХ парметры + полученные мтарицы однородных преобразований      
 Alpha   = [  g2r*(-90)   ;    g2r*(0)   ;    g2r*(0)   ;  g2r*(90)     ;    g2r*(0)   ];
 Apar    = [    0.033     ;    0.155     ;    0.135     ;     0         ;      0       ];
 Dpar    = [    0.147     ;      0       ;      0       ;     0         ;    0.234     ];
 Theta   = [  g2r*(q1+0)  ;  g2r*(q2+0)  ;  g2r*(q3+0)  ;  g2r*(q4+90)  ;  g2r*(0+q5)  ];
 
 T1 = [ cos((pi*q1)/180), 0, -sin((pi*q1)/180), (0.033*cos((pi*q1)/180));
        sin((pi*q1)/180), 0,  cos((pi*q1)/180), (0.033*sin((pi*q1)/180));
                0,        -1,                0,                    0.147;
                0,        0,                 0,                        1];
 
 T2 = [ cos((pi*q2)/180), -sin((pi*q2)/180), 0, (0.155*cos((pi*q2)/180));
        sin((pi*q2)/180),  cos((pi*q2)/180), 0, (0.155*sin((pi*q2)/180));
                       0,                 0, 1,                        0;
                       0,                 0, 0,                        1];          
 

 T3 = [ cos((pi*q3)/180), -sin((pi*q3)/180), 0, (0.135*cos((pi*q3)/180));
        sin((pi*q3)/180),  cos((pi*q3)/180), 0, (0.135*sin((pi*q3)/180));
                       0,                 0, 1,                        0;
                       0,                 0, 0,                        1];
                   
 T4 = [ cos((pi*(q4 + 90))/180), 0,  sin((pi*(q4 + 90))/180), 0;
        sin((pi*(q4 + 90))/180), 0, -cos((pi*(q4 + 90))/180), 0;
                              0, 1,                        0, 0;
                              0, 0,                        0, 1];
            
 T5 = [ cos((pi*q5)/180), -sin((pi*q5)/180), 0,       0;
        sin((pi*q5)/180),  cos((pi*q5)/180), 0,       0;
                       0,                 0, 1,   0.234;
                       0,                 0, 0,       1];                          
                    
%% Вариант Алексея ДХ парметры + полученные мтарицы однородных преобразований  

    %ДХ параметры
% Alpha   = [  g2r*(90)    ;    g2r*(0)   ;    g2r*(0)   ;  g2r*(90)     ;    g2r*(0)   ];
% Apar    = [    0.033     ;    0.155     ;    0.135     ;     0         ;      0       ];
% Dpar    = [    0.147     ;      0       ;      0       ;     0         ;    0.2175    ];
% Theta   = [ g2r*(q1-170) ; g2r*(q2+25)  ; g2r*(q3+150) ;  g2r*(q4)     ;  g2r*(q5-90) ];
    %Полученные матрицы однородных преобразований 
%T1 =  [cos((pi*(q1 - 170))/180),                         0,  sin((pi*(q1 - 170))/180), (0.033*cos((pi*(q1 - 170))/180));
%       sin((pi*(q1 - 170))/180),                         0, -cos((pi*(q1 - 170))/180), (0.033*sin((pi*(q1 - 170))/180));
%                              0,                         1,                         0,                            0.147;
%                              0,                         0,                         0,                                1];
                          
%T2 =  [  cos((pi*(q2 + 25))/180), -sin((pi*(q2 + 25))/180),                         0,  (0.155*cos((pi*(q2 + 25))/180));
%         sin((pi*(q2 + 25))/180),  cos((pi*(q2 + 25))/180),                         0,  (0.155*sin((pi*(q2 + 25))/180));
%                               0,                        0,                         1,                                0;
%                               0,                        0,                         0,                                1];
                         
%T3 =  [ cos((pi*(q3 + 150))/180), -sin((pi*(q3 + 150))/180),                        0,  (0.135*cos((pi*(q3 + 150))/180));
%        sin((pi*(q3 + 150))/180),  cos((pi*(q3 + 150))/180),                        0,  (0.135*sin((pi*(q3 + 150))/180));
%                               0,                         0,                        1,                                 0;
%                               0,                         0,                        0,                                 1];   
                           
%T4 =  [         cos((pi*q4)/180),                         0,          sin((pi*q4)/180),                                 0;
%                sin((pi*q4)/180),                         0,         -cos((pi*q4)/180),                                 0;
%                0,                                        1,                         0,                                 0;
%                0,                                        0,                         0,                                 1];
     
%T5 =  [  cos((pi*(q5 - 90))/180),   -sin((pi*(q5 - 90))/180),                        0,                                  0;
%         sin((pi*(q5 - 90))/180),    cos((pi*(q5 - 90))/180),                        0,                                  0;
%                               0,                          0,                        1,                             0.2175;
%                               0,                          0,                        0,                                  1];          
                           
%% Решение прямой задачи кинематики иформирование однородных матриц преобразований

 T = SolveFK(Theta, Alpha, Apar, Dpar);
    disp('Однородная матрица преобразований к фланцу крайнего звена T = ');
    disp (T);
        X = T(1,4);
        Y = T(2,4);
        Z = T(3,4);
        FK_XYZ = [X, Y, Z];
        disp ('В результате решения ПЗК координаты рабочего инструмента:');
        disp (FK_XYZ);
        
  T01 = [cos(Theta(1)), -sin(Theta(1))*cos(Alpha(1)),  sin(Theta(1))*sin(Alpha(1)), Apar(1)*cos(Theta(1));
                   sin(Theta(1)),  cos(Theta(1))*cos(Alpha(1)), -cos(Theta(1))*sin(Alpha(1)), Apar(1)*sin(Theta(1));
                   0.0,            sin(Alpha(1)),                cos(Alpha(1)),               Dpar(1);
                   0.0,            0.0,                          0.0,                         1.0            ];
            T02 = [cos(Theta(2)), -sin(Theta(2))*cos(Alpha(2)),  sin(Theta(2))*sin(Alpha(2)), Apar(2)*cos(Theta(2));
                   sin(Theta(2)),  cos(Theta(2))*cos(Alpha(2)), -cos(Theta(2))*sin(Alpha(2)), Apar(2)*sin(Theta(2));
                   0.0,            sin(Alpha(2)),                cos(Alpha(2)),               Dpar(2);
                   0.0,            0.0,                          0.0,                         1.0            ];
            T03 = [cos(Theta(3)), -sin(Theta(3))*cos(Alpha(3)),  sin(Theta(3))*sin(Alpha(3)), Apar(3)*cos(Theta(3));
                   sin(Theta(3)),  cos(Theta(3))*cos(Alpha(3)), -cos(Theta(3))*sin(Alpha(3)), Apar(3)*sin(Theta(3));
                   0.0,            sin(Alpha(3)),                cos(Alpha(3)),               Dpar(3);
                   0.0,            0.0,                          0.0,                         1.0            ];
            T04 = [cos(Theta(4)), -sin(Theta(4))*cos(Alpha(4)),  sin(Theta(4))*sin(Alpha(4)), Apar(4)*cos(Theta(4));
                   sin(Theta(4)),  cos(Theta(4))*cos(Alpha(4)), -cos(Theta(4))*sin(Alpha(4)), Apar(4)*sin(Theta(4));
                   0.0,            sin(Alpha(4)),                cos(Alpha(4)),               Dpar(4);
                   0.0,            0.0,                          0.0,                         1.0            ];
            T05 = [cos(Theta(5)), -sin(Theta(5))*cos(Alpha(5)),  sin(Theta(5))*sin(Alpha(5)), Apar(5)*cos(Theta(5));
                   sin(Theta(5)),  cos(Theta(5))*cos(Alpha(5)), -cos(Theta(5))*sin(Alpha(5)), Apar(5)*sin(Theta(5));
                   0.0,            sin(Alpha(5)),                cos(Alpha(5)),               Dpar(5);
                   0.0,            0.0,                          0.0,                         1.0            ];